# # write a query to displays NAME,AGE,GENDER,MARKS of all students whose USN in the STUDENT table is equal to the USN in STU_DEPT table

In [ ]:
SELECT name,age,gender,marks FROM student,stu_dept WHERE stu_dept.USN = student.USN

In [ ]:
create table table1
(column1 NUMBER,
column2 NUMBER,
);
insert into table1 VALUES(1,2);
insert into table1 VALUES(3,4);
insert into table1 VALUES(5,6);
insert into table1 VALUES(7,8);
SELECT * FROM table1;

In [ ]:
Inner join or Join

In [ ]:
# # select * from table1 inner join table2 on table1.column2 = table2.column2 
# select * from table1 T1 inner join table2 T2 on T1.columns2 = T2.columns2
select * from table1 T1 inner join table2 T2 on tabl1.column1 = tabl2.column1

In [ ]:
# LEFT JOIN 
# writ a query to display all the records from table1 and table 2 by left keyword  left join or left outer join
# select * from table1 T1 LEFT JOIN table2 T2 on T1.column2 = T2.column2;

In [1]:
# write a query in which we want all record from table 2 and matching records from table1----
-RIGHT JOIN OR RIGHT OUTER JOIN

# select * from table1 T1 right join table2 on T1.column2 = T2 .column2

In [ ]:
# full OUTER JOIN
# select * from table1 T1 full outer join table2 T2 on T1.column2 = T2.column2

In [ ]:
# NATURAL JOINatural join tab can be a inner join,left join,right join .The default join is INNER JOIN
# select * from table1 natural join table2
# select * from table1 natural right join table2
# select * from table1 natural left join table2
# select * from table1 natural full join table2
# select * from table1 T1 nle2 T2

# sql query to find first and the last record from the table in single query(employee table suppose)

In [ ]:
<!-- select rownum from emp; it create a new column named rownum automatically which has rows equal to total rows in table -->


select count(*) from emp; # display total no of rows in a table , suppose 7 total rows are there in a table
select * from (select rownum r,ename, sal from emp)
where r = 1 or r = (select count(*) from emp)

#  FINDING FIRST N LAST RECORD FROM TABLE IN MYSQL

In [ ]:
select * from customers
LIMIT1;----to get first row out of table
to get 1st n last
(select * from customers order by customerID ASC LIMIT 1)
UNION
(select * from customers order by CustomerID desc LIMIT 1)

# finding first five records from table using my sql

In [ ]:
SELECT * FROM Customers ORDER BY Customer_ID ASC LIMIT 5;

# starting from 3rd row find next 2 records from customers table(mysql)

In [ ]:
select * from Customers order by Customer_id asc limit 3, 2;

 # display last 2 records(rows) from the table emp(oracle and mysql)

BY USING ORACLE
select * from(select rownum r, ename, sal from emp)
where r>(select count(*)-2 from emp);
select * from(select rownum r, emp.* from emp)--to extract all records from last 2 rows
where r>(select count(*)-2 from emp;

In [ ]:
USING MYSQL

SELECT * FROM Employees ORDER BY EmployeeID DESC LIMIT 2;

 # display first and last 2 records from table(by oracle n mysql)

BY USING ORACLE
select * from(select rownum r, emp.* from emp)
where r>(select count(*)-2 from emp) or r in(1,2);

In [ ]:
BY USING MYSQL
(select * from Customers order by CustomerID asc LIMIT 1)
UNION
(select * from Customers order by CustomerID desc LIMIT 2);

# Calculate the second highest salary from customer table

In [ ]:
SELECT MAX(Salary) FROM Employees WHERE Salary NOT IN(SELECT MAX(Salary) FROM Employees);

# Find nth Highest salary from employees  table

In [ ]:
SELECT distinct Salary FROM Employees e1 WHERE 3 = (SELECT COUNT(DISTINCT Salary) FROM Employees e2 WHERE
E2.Salary >E1.Salary);  (this is for 3rd highest)

# Increase the income of all employee by 5%in employee table

In [ ]:

UPDATE Employees SET INCOME = INCOME+(INCOME*5.0/100.0);

# find the number of employees working in 'abc' department in employees table

In [ ]:
select count(*) from employees where where department_name = 'abc';

# retrive the records from employees table where firstname ends with 'a' and contain 6 alphabets

In [ ]:
select * from employees where first_name like' _____a';
SELECT * FROM Employees WHERE FIRSTNAME LIKE' _____a';

# write query to find third highest salary

# display only even rows from table


SELECT * FROM(SELECT rownum r,emp.* from Emp)
WHERE MOD(r,2)=0;
SELECT * FROM(SELECT rownum r, emp.* FROM emp)
WHERE MOD(r,2)=0;

# # display only odd records(rows) from table

select * from (select rownum r, emp.* from emp)
where mod(r,2)=1;

# i only want country column from customers table with no dublicate values and in sorted order.

 select distinct country from customers 
order by country;

# # Select all records from the Customers where the PostalCode column is empty

select * from customers where PostalCode is NULL;

 # D/B INSERT INTO AND ALTER TABLE

insert into statement ----to add record in the column(field)
ALter table means adding new column(with their data type and constraint, or just adding constraint to column) or modifying existing column(modifying means removing their datatype or constraint) or drop column(add,modify,drop)
ALTER table employees
ADD emp_designation VARCHAR(40) NOT NULL; (to a employee table)

desc employees;

WE ALSO WANT TO ADD 'gpa' column to employees(gpa is like 5.89,3.42...etc)
alter table employees
add gpa decimal(3,2) not null;

desc employees;


ANOTHER EXAMPLE--adding multiple column to the table

ALTER TABLE employees
ADD  column emp_address VARCHAR(100) NOT NULL after emp_name,

ADD emp_sal INT(20)  NOT NULL after emp_age;
desc employees;

SUPPOSE, WE ARE ADDING PRIMARY KEY TO THE 2 COLUMNS  emp_age & emp_id, SEE BELOW
alter table employees
add constraint pk_empployee_detail primary key(emp_id, emp_age)
SUPPOSE WE ARE ADDING A UNIQUE KEY TO THE COLUMN EMP_AGE
alter table eployees
add unique(emp_age)

ABOUT INSERT INTO--UPDATES ROWS IN ALL OR SELECTED EXISTING COLUMNS
INSERT INTO employees(empname, city,country)
VALUES("anoop","jhasi","India"),
("sam","meerut","India");
NOW SUPPOSE IN EMPLOYEES TABLE, WE WANT emp_name TO BE TYPE VARCHAR AND COLUMN IS ALLOWED TO HAVE NULL VALUE
ALTER TABLE Employees
MODIFY empname VARCHAR(100) NULL;
select * from Employees;
desc employees;
ALTER TABLE Employees
DROP column emp_name;
select * from Employees;
desc employees;
ALTER TABLE Employees
CHANGE COLUMN emp_name emp_fname
VARCHAR(100) NOT NULL;
select * from employees;
ALTER TABLE Employees------changing table name
RENAME TO emp_details;

NULL MEANS BLANK(missing value) AND NOT 0 OR SPACES

In [ ]:
alter table bank
add column height decimal(2,1) not null after salary,
add column weight decial(3,1) unique after country;
desc bank;

alter table bank
drop column height,
drop column weight;

# some IFNULL CONCEPT IN MY SQL(from javapoint.com)

select IFNULL("python","java")it returns python, if first item(python) is there
--IFNULL always take 2 argument and first chk the first argument or 1st expression
if that is not null then it return 1st expression otherwise 2nd
example below===
select ifnull(NULL,10) it will return 10
select IFNULL(NULL, 5)return 5
select IFNULL('python','Pandas') it will return 'Python

NOW CREATING TABLE
CREATE TABLE emp_details(
emp_id INT NOT NULL AUTO_INCREMENT,
emp_name VARCHAR(45) NOT NULL,
emp_sal INT(56) NOT NULL,
cellphone VARCHAR(30) DEFAULT NULL,
homephone VARCHAR(30) DEFAULT NULL);
INSERT INTO emp_details(emp_id,emp_name,emp_sal,cellphone,homephone)
VALUES(101,"jai",45000,7264372,98257),
(102,"sam",78000,52428282);
and so on and we left some blank value of column homephone and  cellphone)
now if we do
SELECT emp_name, cellphone,homephone FROM emp_details;
it will show all 3 column wid blank space also
BUT IF WE DO

SELECT emp_name, IFNULL(cellphone,homephone) FROM emp_details;--It will chk and take cellphone if it is there (thats mean homephone is null ok) and if cellphone is null then it will take homephone ok)

 # Top 2 record for country spain from customer table by using ms acess or sql server

SELECT TOP 2 * FROM Customers
WHERE Country = 'Spain';

 # Top 3 records from customer table particularly for brazil by using my sql

In [ ]:
select * from Customers
WHERE Country = 'Brazil'
LIMIT 3;
SELECT * FROM Customers
WHERE Country = 'Brazil'
LIMIT 3

select * from customers
where country='Australia'
LIMIT 2

In [ ]:
select top 2 * from customers;
select * from customers
LIMIT 3;

Extracting 1st and last record from tabel
(select * from customers ORDER BY CustomerID ASC LIMIT 1)
UNION
(select * from Customers ORDER BY CustomerID DESC LIMIT 1)

select top 2 * from customers
WHERE country  = 'Germany';

SELECT TOP 3 * from customers
WHERE Country = 'France';

select * from customers
WHERE Country = 'Spain'
LIMIT 2

COUNTING ALL ROWS FROM PRODUCT TABLE  WHERE  PRICE =18
select count(*) from products--counting rows
where price =18;

find product with max price which start wid name 's' from products table

select product, price as Max_Price from products table where price = (select max(price) from products where product like 's%')


provide Name of product with maximum price which ends with 's' having 5 characters
select product, price as Max_Price from products where price = (select max(price) from products where product 
like '____s');



SELECT person, IFNULL(cellnumber,homenumber)phone from customers;

SELECT COUNT(*) FROM Employees WHERE emp_age>32;

# some basic queries(including mysql)javapoint

In [ ]:
SELECT ALL ROWS FROM EMPLOYEE TABLE WHERE EMP_AGE GREATER THAN 32
COUNT FUNCTION

SELECT COUNT(*) from employees where emp_age>32;
SELECT COUNT(DISTINCT emp_name) from employees;
SELECT COUNT(empname) from employees;

SELECT ALL ROWS FROM EMPLOYEE TABLE WHERE Country is Germany
select count(*) from employees where country like 'g%';

AVG FUNCTION 

select avg(price) from products;

provide avg price of products start with 'b'
select avg(price) as Average_Price from employee where product like 'b%';

select avg(price) from products where price >=20; use here <,>,>=,<=,=,<>,between,like

SUM
select sum(quantity) from orderdetails;
select sum(quantity) from orderdetails where quanity <=23
SELECT count(Quantity) from orderdetails where Quantity >20;
SELECT max(Quantity),productID from orderdetails
select sum(quantity) from orderdetails where quantity between 10 and 20;
MIN
finding name of employee with minimum salary
select name, salary as min_salary from employee11 where salary = (select min(salary) from employee11);

finding name of employee with maximum salary
select name, salary as max_salary from employee11 where salary = (select max(salary) from employee11);

select min(emp_sal) from employee;

select min(emp_sal) from employees 
where emp_age >=32 and emp_age<=40;

agewise min sal
select emp_age, min(income) as lowst_income from employees group by emp_age;

similarly wid MAX

select city, min(income) as min_income from employees 
group by city 
having min(income)>15000;
select city, min(income)as lowest_income from employees 
group by city
having min(income)>14000;

# d/b CHAR AND VARCHAR

In [ ]:
CHAR IS USED TO DEFINE THE FIXED LENGTH OF TABLE AND COLUMN
THE LENGTH VALUE COULD BE IN THE RANGE OF 1-255
while VARCHAR is used to adjust the length as required(include number & text in quotes)

# HASH TABLE

In [ ]:
Are in-memory table used for high speed temporary storage.Tt do not support AUTO_INCREMENT

# what are constraints and its type

In [ ]:
constraints are the set of rules which  enforced on the data column of the table
2 type of constraints
column level constraints=constraints apply on the column
table level constraints = constraints apply on the table

AUTO_INCREMENT=add a value to the column automatically wen a new row is added to a table

primary key=uniquely identifies rows in the table.Do not contain null values,It is Unique(by default).
It can be apply on  2 column.
There can be 1 P.K for one table but primary key can have multiple columns.

foreign key=It maintain the relatonship between 2 tables.primary key column in one table(parent) is foreign key in another table(child)
It is the field or a group of field in one table with reference to primary in another table

Default null=allow column to contain null values

not null =  ensure that column do not contain any null value

unique=ensures that all the value in the column must be unique or diferent.It can contain or allow null values

check = ensure that value contain in column meet certain condition.Eg= check age>18

Default = It specify the dafault value for column when no value provided by user

Index = Create and retriev data from the table very fast

In [ ]:
WHAT IS DATA Integrity

In [ ]:
Accuracy of data
Consistency of data

In [ ]:
SQL QUERY TO FIND CURRENT DATE

In [ ]:
select getdate();

In [ ]:
NAME TYPE OF JOINS

In [ ]:
inner join, left join,right join,outer join,cross join,self join,natural join

In [ ]:
WHAT ARE ENTITIES

In [ ]:
A person, thing,pace in the real world about which data can be stored in database in the form of table is called entities
A bank database has a customer table to store customer information

In [ ]:
NORMALIZATION

In [ ]:
It is the process of organizing data to avoid duplication and redundancy

In [ ]:
DIFFERENCE BETWEEN TRUNCATE AND DROP

In [ ]:
TRUNCATE=removes all the records from the table permanently and not the table structure
drop = removing entire table or delete entire table from the database

In [ ]:
WHAT IS SUBQUery

In [ ]:
subquery is basically query inside another query where query is used to retriev data back from database
subquery is executed first and result of the subquery is passed on to the query
select first_name, last_name from employees where addressCode(select addressCode from office where country  ="India")

In [ ]:
HOW TO SELECT NUMBER OF RECORDS FROM TABLE

In [ ]:
select count(*) from table

In [ ]:
HOW YOU INSERT NULL VALUE IN A COLUMN WHILE INSERTING THE DATA

In [ ]:
we will use null keyword in the value constraint

In [ ]:
DIFFERENCE BETWEEN BETWEN AND IN OPERATOR

In [ ]:
BETWEEN =used to display rows based on the range of values
select * from employees where salary between 10000 and 40000

IN = returns rows based on the specific set of values
select first_name, salary from employees where city IN("Gurgaon","Delhi","Lucknow")

In [ ]:
WHAT ARE RECURSIVE STORED PROCEDURE

In [ ]:
recursive procedure which call by itself until reach certain condition
it helps the programmer to use the same set of code n number of times.

In [ ]:
DIFFERENT BETWEEN WHERE AND HAVING CLAUSE

In [ ]:
where clause can be used to filter rows and it works on the row's data
having clause is work on aggregate function and is used after the group by clause
aggregate function like sum,avg,count,max,min,product
aggregate returns one value and can be applied on single column and multiple rows

In [ ]:
WHAT ARE INTERSECT

In [ ]:
It fetch the common records from the two tables
eg=select employee_id from employees table intersect select employee_id from Customers table

In [ ]:
ALIAS IS THE NAME GIVEN TO ANY TABLE OR COLUMN

In [ ]:
WHICH OPERATOR FOR PATTERN MATCHING

In [ ]:
LIKE operator
"a%"=start with a and can have any number of character
"%a"=end with a
"c%n"= start with c and ends with n
'__j'= total 3 character and ends with j 
'ger%'= start with ger
'lon__n' start with lon and end with n
'%cv%'= 'cv' can be anywhere in text

In [ ]:
HOW TO FIND UNIQUE RECORDS

In [ ]:
select DISTINCT emp_name from employees;

# how to fetch first 5 characters from firstname from emplyees table

In [ ]:
select first_name, substr(first_name, 1,5)as new_Name from employees ;
select first_name, RIGHT(first_name, 5)as new_Name from employees;

# Employees hired in n and last month

In [ ]:
MYSQL SERVER

getdate()=to find today date
consider employee table==id FirstName LastName Gender Salary Hiredate
SELECT *,DATEDIFF(MONTH,Hiredate,GETDATE())AS Diff
FROM Employees
ORDER BY Hiredate desc;

HRED IN LAST 3 MONTHS
select *,DATEDIFF(MONTH,Hiredate,GETDATE())AS Diffmonth
FROM Employees
WHERE DATEDIFF(MONTH,Hiredate,GETDATE()) BETWEEN 1 AND 3
ORDER BY Hiredate desc;

we can use current_date() function instead of getdate() in mysql, getdate() is for sqlserver

HIRED IN LAST 30 DAYS
SELECT *,DATEDIFF(DAY,Hiredate,GETDATE())AS Diff
FROM Employees
WHERE DATEDIFF(DAY,Hiredate,GETDATE()) BETWEEN 1 AND 30 DAYS
ORDER BY Hiredate;

HIRED IN LAST 1 YEAR
SELECT *, DATEDIFF(YEAR, Hiredate,GETDATE()) AS Diff
FROM Employees
WHERE DATEDIFF(YEAR,Hiredate,GETDATE())BETWEEN 1 AND 1
ORDER BY Hiredate;

HIRED IN LAST 2 YEAR
BETWEEEN 0 AND 1

# FIND DEPARTMENT NAME WITH HIGHEST NUMBER OF EMPLOYEES

In [ ]:
HERE,We use 2 Tables Departments==DepartmentID,DepartmentName
AND TABLE EMPLOYEES==EmployeeID,EmployeeName,DepartmentID

SELECT Departments.DepartmentName,Count(Employees.EmployeeeName)AS EmployeeCount
FROM Departments INNER JOIN Employees
ON Departments.DepartmentID = Employees.DepartmentID
GROUP BY DepartmentName
ORDER BY EmployeeCount desc;

IF we do,
SELECT TOP 1 Departments.DepartmentName,Count(Employees.EmployeeeName)AS EmployeeCount
FROM Departments INNER JOIN Employees
ON Departments.DepartmentID = Employees.DepartmentID
GROUP BY DepartmentName
ORDER BY EmployeeCount desc;

NOW ,WE ONLY WANT DEPARTMENT NAME WITH HIGHEST NUMBR OF EMPLOYEES(DO NOT DISPLAY EMPLOYEES NUMBER)

SELECT TOP 1 Departments.DepartmentName
FROM Departments INNER JOIN Employees
ON Departments.DepartmentID = Employees.DepartmentID
GROUP BY DepartmentName
ORDER BY COUNT(*) DESC OR COUNT(Employees.EmployeeName) DESC;

# Convert data from rows to colmns

In [ ]:
Name     Value  ID
Name      Adam    1
Gendar     Male    1
Salary    50000   1

SELECT ID,
Max(CASE
WHEN Name = 'Name' THEN Value ELSE " " END) as Name,

Max(CASE
WHEN Name = 'Gender' THEN Value ELSE " "END) as Gender,

Max(CASE
WHEN Name = 'Salary' THEN Value else " " END) AS Salary

from employees
GROUP BY ID;

In [ ]:
Question = Amount category as column 
amount up to $1000 having level of under 1000
amount between $1000 &$5000 having level of under 5000
amount between $5000 to $10000 having level of under 10000

answer = 
select salesID, salesDate,Amount,
case when Amount <1000 then 'Under1K'
when Amount <5000 then 'Under 5K'
when Amount <10000 then 'Under 10K'
else  '10K or more'
end as 'Amount Category'
from sales;

# How to remove duplicate value from tables

In [ ]:
      EmployeeID                FirstName               LastName          Phone Email           Email
1      1                           Adam                    owens            344756364          adam@demo.com
 2     2                           Mark                  Wills              2578654365        mark@demo.com
 3     3                          Natasha                Lee               5428765423            natasha@demo.com
 4     5                          Adam                Owens                4538976554         adam@demo.com
 5     4                          Rley                   Jones            123587553              rhly@demo.com
6      6                          Natasha               Lee                  54328765             natasha@demo.com
        
        
1)SELECT FirstName, LastName,Count(*)
from employees
GROUP BY FirstName,LastName



2)SELECT FirstName,LastName,count(*) as count
from employees
GROUP BY FirstName, LastName
HAVING COUNT(*)>1;

it returns first and last name which occur more than 1 times which means they r also duplicate


SO FROM THE TABLE,first use order by clause

SELECT * FROM Employees
ORDER BY FirstName,LastName;


I will keep the record which has the hightest EmployeeeID So I will keep (5 and 6) EmployeeID
DELETE FROM Employees
WHERE EmployeeID NOT IN(
SELECT MAX(EmployeeID)
FROM Employees
GROUP BY FirstName, LastName);

SELECT * FROM Employees;

# ORDER BY MONTH IN AN YEAR

In [ ]:
MonthName     Sales
it we do
SELECT * FROM Employees
ORDER BY MonthName;--it will sort as april august,december means in alphabet order
We want in Jan,feb,march etc..ok

WAT WE DO IS

SELECT * FROM Sales
ORDER BY Case WHEN MonthName = 'January' Then 1
when monthname  ='Febuary' then 2
when monthname  ='March' then 3
when monthname = 'April' then 4..and so on
ELSE NULL end;

2)
date            sales
2018-01-01       3000
2018-11-19     1000
.....            ....

We have to convert this date to monthname and then put in order
SELECT DATENAME(MONTH, date) AS Month_Name, MONTH(date) AS Month,Sales
FROM Employees
ORDER BY MONTH(date);

SELECT DATENAME(MONTH, date) AS Month_Name,Sales
FROM Employees
ORDER BY MONTH(date);

In [ ]:


WHAT IS A VIEW

In [ ]:
A view is a virtual table which consists of subset of data contained in a table.It can have data of one or more
table combined and it takes less memory to store

In [ ]:
DIFFERENT BETWEEN PRIMARY KEY AND UNIQUE KEY

In [ ]:
ONLY 1 primary key in a row,canot accept null value
there can be multiple unique in a row,can accept one nul value

In [ ]:
TYPES OF DATATYPE=char,varchar,text,int,float,double,decimal,tinyint,datetime,date,time,year,bool
decimal(3,2)=it means overall 3 and 2 after decimal ok
decimal(5,2) = total can be 5 but 2 after the deciimal eg=190.60,80.40,73.70

In [ ]:
CREATE AND DROP DATABASE

In [ ]:
show databases;
create database if not exists storage24;
show databases;
use storage24;
drop database if exists storage24;
use storage25;
show tables;---------showing table in storage25 database

In [ ]:
CREATE TABLE WITH PRIMARY AND FOREIGN KEY AND ALTER TABLE FOR PRIMARY N FOREIGN KEY,applying multiple P.K and F.K

In [ ]:
use storage24;
create table tasks(
task_ID int not null,
taskName varchar(45) not null ,
start_date date unique,-------------unique constraint can have null values, ok
due_date date not null
priority tinyint not null,
age int,
PRIMARY KEY(task_ID)
);
create table Orders(
Order_ID int not null,
task_ID int not null,
productName varchar(40) unique,
price int not null,
customer_Name varchar(56) not null,
PRIMARY KEY(Order_ID),
FOREIGN KEY(task_ID)REFERENCES tasks(task_ID)

In [ ]:
PRIMARY KEY----

In [ ]:
ABOUT PRIMARY KEY

use storage24;
create table users(
user_ID int auto_increment not null,
userName varchar(56) not null,
password varchar(67) not null,
email varchar(70),
salary int unique,
PRIMARY KEY(user_ID)
);
create table roles(
roll_ID int auto_increment not null,
name varchar(60) not null,
subject varchar(35) unique,
PRIMARY KEY(roll_ID)
);
create table user_roles(
user_ID int not null,
roll_ID int not null,
height decimal(5,2) unique,
address varchar(100),
PRIMARY KEY(user_ID, roll_ID),
FOREIGN KEY(user_ID) REFERENCES users(user_ID),
FOREIGN KEY(roll_ID) REFERENCES roles(roll_ID)
);

In [ ]:
SOMETIMES TO ADD 2 COLUMN IN PRIMARY KEY WE USE

CREATE table persons(
id int auto_increment not null,
Last_name varchar(170) not null,
first_name varchar(79),
CONSTRAINT PK_person PRIMARY KEY(id, Last_name)
);

In [ ]:
NOW ADDING PRIMARY KEY TO ALREADY EXISTS TABLE(suppose employees table, we using P.K ON Emp_ID)
when you create any column of table(suppose table1) as unique and not null then that column will automatically show primary key
when use command 'decribe' for that table(suppose table1), ok 

ALTER table Employees
ADD PRIMARY KEY(Emp_ID);--while adding primary key remember EMP_ID in Employees table should not contain auto_increment and there should be no
already existing primary key on any column bcoz,there can be only one primary key for the table ,ok

NOW ADDING TWO PRIMARY KEY TO ALREADY EXISTS TABLE(suppose employees table, we using P.K ON Emp_ID, and Last_Name)
ALTER table Employees
ADD CONSTRAINT PK_person PRIMARY KEY(Emp_ID, Last_Name)==both Emp_ID and Last_Name should be unique and not null ok

In [ ]:
DROP SINGLE AND DOUBLE PRIMARY KEY
ALTER table Employees
DROP PRIMARY KEY;
we can use drop primary key above when we created primary key for 2 column through alter table
eg
alter table xyz
add constraint pk_person primary key(emp_id,age);

now we can drop primary key

alter table xyz
drop primary key;

desc xyz

In [ ]:
FOREIGN KEY

In [ ]:
FOR APPLY FOREIGN KEY
suppose

create table orders(
order_ID int auto_increment not null,
person_ID int not null,
last_name varchar(100) not null,
salary int unique,
PRIMARY KEY(order_ID),
FOREIGN KEY(person_ID) REFERENCES person(person_ID)
);

In [ ]:
ADDING FOREIGN KEY ON ALREADY EXISTING TABLE ORDERS(on personID)
ALTER table Orders
ADD FOREIGN KEY(personID) REFERENCES person(personID)

ADDING FOREIGN ON MULTIPLE COLUMNS ON THE ORDERS TABLE
ALTER table orders
ADD CONSTRAINT FK_Person FOREIGN KEY(personID) REFERENCES person(personID)

In [ ]:
DROP FOREIGN KEY

ALTER TABLE orders
DROP CONSTRAINT FK_personorder;

In [ ]:
create table patient(
Name varchar(50) not null,
age int unique,
Height(3,2) not null,
weight decimal(4,2)
);

In [ ]:
BACKUP DATABASE

backup database testDB
to file = 'jhjhj\jhjhj\jkj';

BACK SOME PART OF DATABASE STILL THE LAST FULL BACKUP

backup database testDB
to file ='jhj\hghg\hjh'
WITH DIFFERENTIAL;

In [ ]:
CREATING TABLE FROM ANOTHER TABLE
create table Customers1 as
select Custome_id, City,Country
from Customers
WHERE Country = "Germany";
remember dob date (it is in yyyy-mm-dd format)
example below=
insert into bank(client_id,user_id,dob,salary,city,vehicle)
values(4,104,'1992-10-25',68000,'guior','maruib');

In [ ]:
NOT NULL CONSTRAINT

In [ ]:
NOT NULL:- constraint-It can be added while creating table and if it is not there then we can alter
table and modify any column to 'not null' constraint 
eg=
    alter table person
    modify column lastname varchar(50) not null,
    modify column  address char(255) not null;
    desc person;
   
NOTE: we can not add or drop 'not null' constraint

In [ ]:
UNIQUE CONSTRAINT(It may already there or i am adding it or dropping it from table)

In [ ]:
ALTER TABLE FOR UNIQUE CONSTRAINT

SUPPOSE FROM THE TABLE USERS , WE WANT columns id and salary to be unique, then we use-
when we are adding unique to only one column named 'ID' in users table
alter table users
add unique(id);

When we are adding unique constraint to 2 columns of users table, then-
alter table person
Add CONSTRAINT uc_person UNIQUE(id, salary);
NOTE: we can drop the UNIQUE constraint in pair suppose-
ALTER table persons 
drop index uc_person(name of unique constraint)and single unique constraint can also be drop
OR 
alter table person11
add unique(salary),
add unique(email);
NOW DROPPING unique constraint here, 
alter table person11
drop index salary,
drop index email;

Alter table persons
modify address varchar(100)unique TO modify address varchar(80)- it will only modify varchar(100)to 80 but unique consraint
will remain there ok,so we have to drop the entire column by using alter table persons drop column address
and reasign column address without unique constraint.

OR
ADD UNIQUE INDEX username_unique(username ASC)
ADD UNIQUE INDEX email_unique(email ASC)

See below Table,
use Employeedb;
create table vol_1(
id int not null auto_increment unique,
Name varchar(30) not null,
address varchar(40) not null,
phone varchar(20) default '95606617380',
salary int check(salary>10000),
primary key(id),
unique(address)
);
TO DROP UNIQUE constraint from here on address, we use,
alter table vol_1
drop index address;---here we use name of column on which unique constraint is applied, like in this case we have 
column named 'address' ok

In [ ]:
use storage24;
create table Suppliers(
supplier_id int,
Name varchar(70) not null,
phone varchar(20) not null unique,
Address varchar(100) not null,
salary int,
primary key(supplier_id),
CONSTRAINT uc_person unique(Name, Address)---this kind of unique constraint can be drop 
);
alter table suppliers
drop index phone;
desc suppliers;

alter table suppliers
drop index uc_person;
desc suppliers;
show index from suppliers;

In [ ]:
use storage24;
Alter table Suppliers
modify supplier_id int auto_increment;----we have added auto_increment to supplier_id
this auto_increment automaticaly add value wen we insert value to table
NOW

insert into Suppliers(Name, phone,Address,salary)--see here we have not mention supplier_id bcoz it is auto_increment
values('jai','9876356354','101,sanskriti,10A',45000);
NOW USE
show index from suppliers;
desc suppliers

NOW if you use
alter table suppliers
drop index uc_person ----- then it will remove niche wala unique(name, addres) and not which is on the phone column

In [ ]:
DEFAULT CONSTRAINT-add default value to the column of the table when user do not provide values to column

In [ ]:
create table basic_info(
person_id int,
First_Name varchar(100) not null,
Last_Name varchar(67) not null unique,
salary int,
City varchar(70) default 'Gurgaon',---but it can be dublicate here as no unique mention over here
PRIMARY KEY(person_id)
);

Now wen we insert value suppose
When  we given default value for column 'city' that is gurgaon then while entering records if you do not want to give value
to city then do not mention 'city' column into insert wala statement ok,then it will show Gurgaon only, and
if you wish to give any value then only give'city' column name to 'insert into' wala statement

 insert into basic_info(person_id,First_Name,Last_name,salary)
values(05,'viraaz','Khan',45000);
we haven't add column  City in insert so sql automatically provide city column value as 'Gurgaon' only, every time
so when we insert value ,it will provide 'Gurgaon' only in City column
but wen we use
insert into basic_info(person_id,First_Name,Last_name,salary,city)
values(05,'viraaz','Khan',null, 'Hisar');
here, city name is provided so in city column it will show Hisar and not 'Gurgaon'
now again we inserted
insert into basic_info(person_id,First_Name,Last_name,salary,city)
values(06,'viraaz','kalra',NULL, 'Hisar');
here person_id is 06 bcoz it is primary key so value should be inserted differently everytime
On First_Name  not null constraint is used so we cannot left it blank, 
but we can also insert same value in First_Name as unique constraint is not used, so we insert
same Viraaz name here.
On Last_Name not null and unique both constraint is used so either we can left it blank or insert same value
so we  use 'Kalra' here
on salary, no constraint is used so we can use same value for salary or  we can left  it as 'NULL value'

In [ ]:
ADDING DEFAULT CONSTRAINT TO THE TABLE person(wen there is no default constraint on the table)
ALTER table person
alter column City SET DEFAULT 'Gurgaon';

DROP DEFAULT CONSTRAINT FROM THE person table, WE USE
ALTER table person
alter  column City DROP DEFAULT;

In [ ]:
INDEX CONSTRAINT

In [ ]:
INDEX = It retrieve the data from the database very quickly.It speed up the queries.
Updating a table takes more time with indexes then without
create index inx_person
on persons(Firstname);

create index inx_person
on persons(lastname, firstname);

create unique index ind_person
on person(salary);

DROP
alter table persons
drop index inx_person;

In [ ]:
CHECK CONSTRAINT

##### Create table person12(
person_id int,
FirstName varchar(60) not null,
LastName varchar(50) not null unique,
phone varchar(15)                                                                    unique,
price decimal(5,1) check(price>3000),
age int check(age>18),
city varchar(90) default 'Gurgaon',
primary key(person_id)
);
OR
create table person13(
person_id int,
name varchar(67) not null,
phone varchar(20) unique,
cost decimal(4,1),
city varchar(50),
primary key(person_id),
CONSTRAINT chk_person check(cost>200 and city = 'Mumbai')
);

insert into person12(person_id,FirstName,LastName,phone,price,age)
values(01,'jai','Tiwari','9087654387',4000.3,20);
here we cannot give age less than 18 and price must be greater than 3000, ok
ADDING CHECK CONSTRAINT TO TABLE WHICH DO NOT HAVE CHECK CONSTRAINT SUPPOSE TABLE PERSON12 DO NOT HAVE CHECK CONSTRAINT
adding single check constraint
alter table person12
add check(age>18);

adding check constraint on multiple column of person12 table
alter table person12
add constraint chk_person check(age>18 and price>3000);

droping check constraint from table12
alter table table12
drop check chk_person
NOTE: we can remove check constraint from the table when it is added in pair(wen it define below table while creating table)

use Employeedb;
create table household(
item_id int auto_increment,
soap varchar(20) not null unique,
fruits varchar(40) not null,
price decimal(4,1) unique check(price>200),
country varchar(50) default 'Germany',
city varchar(30) default null,
primary key(item_id),
unique(country)
);
here we cannot drop check constraint as there is no name of constraint , ok so there check constraint cannot be drop 
from 'country' column

In [ ]:
AUTO_INCREMENT-It allows unique number to be generated automaticaly when a new record is inserted into a table.
this is like primary key
by mistake I have create table student with same three records

insert into student(Name,height,subject)
values('mahek','6.1','maths');--three times same
so how we remove it see here
remove from student where student_id = 3;

ALTER
alter table student
auto_increment = 50;

In [ ]:
use storage24;
create table student(
student_id int auto_increment not null unique,
Name varchar(45) not null,
height decimal(3,1),
subject varchar(36) not null 
);
here we have to include unique constraint when we use auto_increment otherwise it will show error if unique also there
in other column

In [ ]:
WORKING WITH DATES

In [ ]:
Create table demotable(
employee_id int auto_increment unique,
emp_name varchar(90) not null unique,
age int check(age>18),
joiningdate date,
);
if joiningdate datatype is INT then we use 2019,2020,2012..etc
'date' datatype means 'yyyy-mm-dd'
insert into demotable(emp_name, age, joiningdate)
values(20, '2021-01-21'),
(21,'2021-02-04'),
(19,'2019-06-30'),
(24,'2020-04-27')
(null,'2020-10-24');
if u forget to add column  emp_name values then,  first add by using alter table demotable add emp_name varchar(50)not null 
and now u have to fill that column that has null value by default so u have to update the column's record
 by using update demotable set emp_name = 'jai' where employee_id  =1

update demotable
set emp_name = 'jai'
where employee_id=1;

update demotable
set emp_name = "sam"
where employee_id = 2;
and so on...

select * from demotable where joiningdate= '2021-01-21';
simply write in sql editor
select curdate()
select curtime()
select datediff('2021-05-24', '2020-12-21');---gives number of days between two dates
select dayname('2021-10-24');
select dayofmonth('2021-10-24');
select dayofyear('2021-10-24');
select extract(year from '2021-05-24');
select extract(year_month from '2021-05-24');
select from_days(897654);--we get a date here

In [ ]:
VIEW

In [ ]:
VIEW:it is a virtual table that consists of data set from the tables in the database.It contains row and columns of 
    other table in database.It can be combination  of data of  2 or more table together.It consumed less memory.

In [ ]:
Example Creating table named product above average  from products table
create view[product above average] as
select productName, price from products
where price>(select avg(price) from products);
select * from[product above average]

example2
create view[Brazil customers] as
select CustomerName, Address,Country
from Customers
where country = 'Bzazil;'
select * from[Brazil Customers]

UPDATING A VIEW
we can update a view by create or replace view, ok
suppose in existing view table[Brazil customers]which we have created, we want to add ContactName then, see below
create or replace view[Brazil customers] as
select CustomerName,City,Country,ContactName
from customers
where country = ' Brazil';

TO DROP VIEW
drop view[Brazil customers]

example3 =create view of products start with 'c' and price between 10 and 60
CREATE VIEW[new_products] as
select ProductName, ProductID 
FROM Products
where ProductName LIKE 'c%'
and price BETWEEN 10 AND 60

In [ ]:
RENAMING TABLE (SINGLE)
use storage24;
RENAME table basic_info TO info_table;
RENAME TABLE(MULTIPLE)
RENAME table customers TO Employees,shirts to garments;
THROUGH ALTER
alter table shirts
RENAME TO Garments;

In [ ]:
ALTER
alter table persons
drop column email;

In [ ]:
ALTER TABLE(ADD)--it means adding column and their datatype and constraint(optional)
alter table Vehicles
add model varchar(80) not null,
add note varchar(100);
select * from Vehicles;

more examples
alter table vehicles
add phone varchar(20) not null after model;

NOW SUPPOSE WE ARE ADDING COLOUR AFTER PHONE COLUMN (EXISTING)AND BRANCH AFTER NOTE COLUMN(EXISTING)
Alter table vehicles
add color varchar(30) not null after phone,
add branch varchar(60) default null after note;

In [ ]:
alter table Vehicles
modify note varchar(80) not null;
select * from Vehicles;

In [ ]:
Alter table vehicles(MODIFY)----(Here we can modify datatype and constraint ok)same time both or any1 at a time
modify year smallint not null,---------earlier also not null
modify color varchar(50)  null after model;---earier also null
select * from vehicles;

we can also do
alter table vehicles
modify year smallint null,--change int to smallint and not null to null value
modify color varchar(50) null after note;----change varchar(20) to 50 and place color column after note, ok

ALTER TABLE(CHANGE)
alter table vehicles
change column note vehiclecondition varchar(100) not null;
select * from vehicles;

more examples
alter table vehicles
change column phone mobile_number int not null;

In [ ]:
ALTER TABLE(DROP)
alter table vehicles
drop column vehiclecondition;

EXAMPLES(MORE)
alter table vehicles
drop column mobile_number,
drop column branch;

In [ ]:
ALTER TABLE(TABLE NAME CHANGED)
alter table vehicles
rename to cars

In [ ]:
TRUNCATE TABLE:-delete all records from the table permanently and not table

In [ ]:
wen we truncate,
1)there is no rollback
2)there should be no foreign key on table
TRUNCATE table Customers;(suppose table is customers)
IF YOU HAVE FOREIGN KEY ON TABLE THEN FIRST REMOVE IT ,THEN APPLY TRUNCATE ON TABLE
to disable foreign key,we use
SET FOREIGN_KEY_CHECKS = 0;
to unable foreign we use
SET FOREIGN_KEY_CHECKS = 1;

TO USE TRUNCATE ON MULTIPLE TABLE WE USE
select concat('Truncate table', customers, customers2)
from information_schema.tables
where table_schema = 'storage24';

truncate table customers;

DROP MUTIPLE TABLE
DROP TABLE IF EXISTS customers,customers2,cars,shirts;

In [ ]:
COPY/DUPLICATE TABLE

Here we have created table basic1 in storage24 database from table family_info in jai_84 database.
use storage24;
create table storage24.basic1
like jai_84.family_info;
insert storage24.basic1
select * from jai_84.family_info;

IF WANT TO CREATE NEW TABLE FROM OTHR TABLE IN SAME DATABASE
CREATE table basic1 as
select * from customers
where city='Gurgaon'
OR
CREATE table basic2 as
select customerName,salary,id
from products
where price>20;

In [ ]:
IF YOU WANT TO KNOW WHERE(ENGINE)YOUR TABLE LOCATED
select table_name,engine
from information_schema.tables
where table_name = 'info_basic';
NOW REPAIR TABLE
REAPAIR TABLE info_basic;

IF IT NOT REPAIR THEN FIRST ALTER ITS NAME AND THEN REPAIR
alter table info_basic
engine = 'isam';
repair table info_basic;

In [ ]:
LOCK TABLE
CREATE TABLE info_table (   
    Id INT NOT NULL AUTO_INCREMENT,   
    Name VARCHAR(50) NOT NULL,   
    Message VARCHAR(80) NOT NULL,  
    PRIMARY KEY (Id)   
);
insert into info_table(Name,Message)
values('jai','hi m here'),
('sam','m fine');

NOW WE can LOCK THE TABLE, so that we can not be able to insert values
LOCK TABLE info_table READ;

TO RELEASE LOCK WE CAN USE
unlock table;

TO LOCK MULTIPLES TABLE
LOCK TABLE shirts READ,
employees READ;

TO RELEASE BOTH
unlock tables;

In [ ]:
UPDATE TABLE EMPLOYEES
Eg
UPDATE Employees set name = 'jai', city = 'Gurgaon' where id = 'a001';

In [ ]:
INSERTING DATA IN TABLE
CREATE TABLE People(  
id int NOT NULL AUTO_INCREMENT,  
name varchar(45) NOT NULL,  
occupation varchar(35) NOT NULL,  
age int,  
PRIMARY KEY (id)  
);
INSERT INTO people(name,occupation,age)
values('tomy','dr',32),
('mandy','clerk',39);

OR wecan use

INSERT INTO people values('tomy','dr',32),
('mandy','clerk',39);

IF WE WANT TO INSERT VALUES FOR SPECIFIC COLUMN THEN,
INSERT INTO people(name,occupation)
values('sam','po'),('aarti','engg');

In [ ]:
UPDATE A EXISTING TABLE(its rows)from javapoint                    table name=trainer
id   course_name   trainer   email                  occupation
101    java           mike      mike@javapoint       engg
 102   python        james      james@javapoint       developer
103    android        robin     robin@javapoint        leader      
104    hadoop         stephen    stephen@javapoint     leader
105    testing        michael    michael@javapoint      scientist

 update trainer set email = 'mike@tutorialpoint.com' where course_ name = 'java';   
THEN USE
SELECT * FROM trainer;

example2
update trainer set trainer = 'jai', occcupation = 'machine learnig' where id = 105;

In [ ]:
DELETE OPERATION

In [ ]:
suppose deleting record from employees table with id =105
delete from employees where emp_id =105;

example2 USING ORDER BY WITH LIMIT for deletion
suppose from employees table i want to remove first three employees record alphabetically.
so we have name column in table first we sort it alphabetically and then remove first three record. ok
delete from employees order by emp_name limit 3;

NOW,  I WANT TO DELETE RECORDS FROM 2 TABLE SIMULANEOUSLY
two table are employees, payment which has common table emp_id, ok

delete Employees,payment from Employees inner join payment on employees.emp_id = payment.emp_id
where emp_id = 105;

In [ ]:
CREATING DATABASE(Through mysql command line client)
create database if not exists Employedb;
show create database Employeedb;
show databases;(To see all databases that exists in your mysql server, do not forget to refresh) 
OR
show schemas;
use Employeedb;
show tables;
describe orders24(to see descriptopn of a particular table)
select * from orders24;
show index from orders24;
show columns from orders24;
create table volumn(
id int not null auto_increment unique,
project_id int not null,
Building_name varchar(100) not null,
builder_name varchar(30) unique not null,
age int not null,
salary decimal(7,2) check(salary>11000),
city varchar(50) default 'Gurgaon',
constraint pk_name primary key(id, Builder_name),
foreign key(project_id)REFERENCES Projectname(project_id)
;
insert into volumn values(01,b1,'upasanamega','jai',35,21000);

In [ ]:
----STORED PROCEDURE-----

In [ ]:
There ae some Sql Code or sql query which we have to write and reused over and over again so wat we can do is
we can store them as stored procedure.Whenevr required just call it and execute it
We can also pass parameter to a stored procedure, so that stored procedure can act based on the parameter value

In [ ]:
CREATE PROCEDURE SelectAllCustomers
AS
Select * from Customers
GO;
EXEC SelectAllCustomers

In [ ]:
STORED PROCEDURE WITH PARAMETER

In [ ]:
WE WANT ALL CUSTOMERS FROM CUSTOMERS TABLE FROM A PARICULAR CITY Eg=London
CREATE PROCEDURE SelectAllcustomers @city nvarchar(30)
AS
SELECT * from Customers where city = @city
GO;
NOW EXECUTE THE QUERY USING STORED PROCEDURE
EXEC SelectAllCustomers @city = 'London';

In [ ]:
STORED PRODECURE WITH MULTIPLE PARAMETERS

In [ ]:
WE WANT ALL CUSTOMERS FROM CUSTOMERS TABLE AND FROM A PARTICULAR CITY AND POSTAL CODE
CREATE PROCEDURE SelectAllCustomers @City nvarchar(30), @postalcode nvarchar(10)
AS
Select * from Customers WHERE Ciy = @city AND PostalCode = @PostalCode
GO;
NOW EXECUTE
EXEC SelectAllCustomers@city = 'London', @postalcode = 'WA1 P1';

In [ ]:
JOINS-combining rows from 2 or more tables based on common column between them(between those 2 or 3 tables)

In [ ]:
suppose joining(join or inner join) 2 tables orders and customers on the basis of common column between 
customerID
1)joining all column of 2 tables
SELECT * from orders
INNER JOIN Customers
ON Orders.CustomerID = Customers.CustomerID

2) JOINING FEW COLUMNS OF both the 2 TABLES(INNER JOIN)

SELECT Customers.CustomerName,Customers.City,Orders.OrderDate
FROM Customers INNER JOIN Orders
ON Customers.CustomerID = Orders.CustomerID;

3)
SELECT Customers.ContactName, Customers.Country,Orders.OrderID
FROM Customers INNER JOIN Orders
ON Customers.CustomerID = Orders.CustomerID;

JOINING THREE TABLES
Orders and Customers on common column 'customerID', orders and shippers table on common column 'ShipperID'
1)
SELECT Orders.OrderDate, Customers.ContactName, Customers.Country,Shippers.ShipperName
FROM ((Orders INNER JOIN Customers ON Orders.CustomerID = Customers.CustomerID)
INNER JOIN Shippers ON Orders.ShipperID = Shippers.ShipperID);

2)
SELECT Orders.OrderID, Customers.CustomerName,Customers.Country,Shippers.ShipperName
FROM((Orders INNER JOIN Customers ON Orders.CustomerID = Customers.CustomerID)
INNER JOIN Shippers ON Orders.ShipperID = Shippers.ShipperID)
WHERE Country = 'Finland'
order by Orders.OrderID desc;

In [ ]:
LEFT JOIN:-It returns all records from the left table(tabe1) and matching records from the right table(table2)

In [1]:
Suppose 2 table customers(table1) and orders(table2) commmon table customerID
1)
SELECT Customers.ContactName, Customers.Country,Orders.Orderdate
FROM Customers LEFT JOIN Orders
ON Customers.CustomerID = Orders.CustomerID
ORDER BY Customers.ContactName;

NOW, CONSIDER PRODUCTS TABLE(TABLE1) AND SUPPLIERS TABLE(TABLE2), common column between them is  'SupplierID'
and returns price where price is price>40, ok
2)
SELECT Products.ProductName, Products.Price,Suppliers.SupplierName
FROM Products LEFT JOIN Suppliers
On Products.SupplierID = Suppliers.SupplierID
WHERE Price>40;

3)I want all products which have price Greater than 20 and from country 'USA'

SELECT Products.ProductName, Products.Price,Suppliers.Country
FROM Products LEFT JOIN Suppliers
ON Products.SupplierID = Suppliers.SupplierID
WHERE Price>20 AND Country = 'USA';

USING GROUP BY CLAUSE
4)
SELECT Products.ProductName, Products.Price, Suppliers.SupplierName
FROM Products LEFT JOIN Suppliers
ON Products.SupplierID = Suppliers.SupplierID
GROUP BY Price;
5)
SELECT Customers.ContactName,Customers.Country,Orders.OrderDate
FROM Customers LEFT JOIN Orders
ON Customers.CustomerID = Orders.CustomerID
WHERE OrderDate IS NULL;
6)
JOINING THREE TABLES WHERE PRICE >40(OrderDetails,Products,Suppliers)products=OrderDetails(ProductID=common column),
Products = Suppliers(SupplierID=common columnn), ok

SELECT Products.ProductName,Products.Price,Products.CategoryID,OrderDetails.Quantity,Suppliers.SupplierName
FROM ((Products LEFT JOIN OrderDetails ON Products.ProductID = OrderDetails.ProductID)
LEFT JOIN Suppliers ON Products.SupplierID = Suppliers.SupplierID)--upto here 518 records
WHERE Price >40;
OR 
ORDER BY Products.ProductName(ASC or DESC);

7)I Want ProuctName with quantity less than 20 and country='Germany
'(here we need products,OrderDetails and Suppliers table)

SELECT products.ProductName, OrderDetails.Quantity,Suppliers.Country
FROM(( Products LEFT JOIN OrderDetails ON Products.ProductID = OrderDetails.ProductID)
LEFT JOIN Suppliers ON Products.SupplierID  =Suppliers.SupplierID)
WHERE Quantity<20 AND Country = 'Germany';

SyntaxError: invalid syntax (<ipython-input-1-a11b12fdc3ac>, line 1)

In [ ]:
RIGHT JOIN:-It returns All the Records from the Right Table(TABLE_2) and matching records from the left table(table_1)

In [ ]:
SELECT Orders.OrderID, Employees.LastName, Employees.FirstName
FROM Orders RIGHT JOIN Employees
ON Orders.EmployeeID = Employees.EmployeeID
ORDER BY Orders.OrderID;

2)Products and Supplier table
ON the Right side I want All SupplierName with Price Between 40 and 70.

SELECT Products.ProductName, Products.Price,Suppliers.SupplierName
FROM Products RIGHT JOIN Suppliers
ON Products.SupplierID = Suppliers.SupplierID
WHERE Price>40 AND Price<70;

SELECT Customers.ContactName, Orders.OrderID
FROM Customers RIGHT JOIN Orders
ON Customers.CustomerID = Orders.CustomerID
WHERE OrderID IS NULL;

SELECT Products.ProductName,Products.Price,OrderDetails.Quantity,Suppliers.SupplierName
FROM((Products RIGHT JOIN OrderDetails ON Products.ProductID = OrderDetails.ProductID)
RIGHT JOIN Suppliers ON Products.SupplierID = Suppliers.SupplierID)
ORDER BY Products.ProductName;

In [ ]:
FULL JOIN OR FULL OUTER JOIN

In [ ]:
It returns all the Records when there is a match in left(table1) or right(table2)

In [ ]:
SELECT Customers.CustomerName, Customers.City, Orders.OrderID
FROM Customers FULL OUTER JOIN Orders
ON Customers.CustomerID = Orders.CustomerID
ORDER BY Customers.CustomerName;

In [ ]:
SELF JOIN 
WHEN A TABLE JOINED BY Itself

In [2]:
Finding out matching Customers from customers table which are from the same city

SELECT A.CustomersName as Name1, A.City,B.CustomerName as Name2
FROM Customers A, Customers B
WHERE A.CustomerID <> B.CustomerID
AND A.City  =B.city
ORDER BY A.CITY;



studentID  Name    CourseID  Duration
1          adam      1       3
2           peter    2       4
1          adam      2       4
3           brian    3       2
2           shane    3       5

wat i want here is all student id and name  from table(student) where studentId is equal and course is not equal, ok
select s1.studentID, s1.name
from student as s1, student as s2
where s1.studentID = s2.StudentID
AND s1.CourseID<>s2.CourseID;

select s1.studentID, s1.name
FROM student s1 inner join student s2
where s1.studentID  =s2.studentID
and s1.courseID<>s2.courseID
group by studentID

SyntaxError: invalid syntax (<ipython-input-2-88978d3fe1bc>, line 1)

In [ ]:
CROSS JOINS----
suppose 2 table customers and contact
performig cross joining

SELECT * FROM Customers
CROSS JOIN Contact;--it will return all colun from both table(also duplicate columns)
6 rows(Total rows) from customers multiply by 4 rows(Total rows) from contact we get 24 rows total

2)
SELECT customers.customerID,customers.customername,customer.income,orders.orderID, Orders.Price
FROM Customers CROSS JOIN Orders USING(CustomerID)
where price>1500 and price<5000;

In [ ]:
'NATURAL JOIN--DO NOT NEED TO SPECIFY 'USING' OR 'ON'(work as inner join)..HERE 
It returns unique columns unlike inner joins which returns duplicate columns also.

In [ ]:
suppose 2 table customers(id,customername,account,email) and balance(id,account,balance).
balance float(10,2)use this data type, and account int (use int data type)
SELECT * from customers NATURAL JOIN balance;--it will return all column from both table except dupliate one
id,customername,account,email,balance

2)
select c.customername, b.balance
from customers as c NATURAL JOIN balance as b;--bring same result as inner joins except duplicate columns

3)
SELECT c.customername, b.balance
from customername as c NATURAL JOIN balance as b
where b.balance>5000;


supose 3rd table is customer_info(account int,
                                 mobile varchar,
                                  address varchar)

then natural join three tables, we get

SELECT C.customerName,C.account,B.balance,I.mobile
from Customers as c natural join Balance as b
natural join customer_info as I;

In [ ]:
AVG() FUNCTION

In [ ]:
AVG()FUNCTION --SEE JAVAPOINT MYSQL TUTORIAL 

SUPPOSE EMPLOYEE TABLE(emp_id,emp_name,occupation,working_date,working hours)
supose we have to find avg working hrs of employees
select avg(working hours)from employees;

1)Suppose we have to find avg working hrs of All Employees whose workig hours>=12
SELECT AVG(working hours) as avg_working_hours from employees where workinh hours>=12;

2)I want emp_name, occupation and avg working hours with respect to each occupation

select emp_name, occupation, avg(working hours)as avg_working_hours from employees
group by occupation

3)I want emp_name,occupation and avg working hours with respect to each occupation where avg workinh hours >9, ok

SELECT emp_name, occupation,avg(working hours)as avg_working_hours from employees
group by occupation
having avg(working hours)>=9;

In [ ]:
COUNT FUNCTION

In [ ]:
COUNT FUNCTION
COUNT(*)IT COUNTS ALL ROWS INCLUDING DUPLICATE,NULL,NOT NULL
COUNT(DISTINCT)IT COUNT UNIQIE ROWS AND NOT NULL
COUNT(EXPRESSION)eg=count(lastname),RETURN DESIRED RESULT WITH WITHOUT NULL VALUES.

suppose consider a Employees table(emp_id,emp_name,emp_age,city,salary)

1)suppose I have to calculate total number of employees in employees table
select count(emp_name)as total_employees from employees;

2)Returns all the rows from employees table where emp_age>32
select count(*) from employees where emp_age>32;

3)Count unique emp_name
select count(distinct emp_name) from employees;

4)returns total number of employees in each city
SELECT emp_name, city,count(*) from employees
group by city
group by age greater than equal to 2
5)SELECT emp_name,age,count(*) from employees
group by age
having count(*)>=2
ORDER BY count(*);

In [ ]:
SUM() FUNCTION

In [ ]:
SUPPOSE EMPLOYEE TABLE(emp_id,emp_name,occupation,working_date,working hours)

1)calculate total number of working hours of all employees
select sum(working hours) as total_working_hours from employees;

2)
select sum(working hours)as total_working_hours from employees where working_hours>12;

3)This statement calculates the total working hours of each occupation
select emp_id,occupation,sum(working hours) as total_working_hours from employees
group by occupation

4)Total working hours of all employees based on their occupation and show whose total working hours>24
select emp_id, emp_name,occupation,sum(working hours) as total_working_hours from employees
group by ocupation
having sum(working hours)>24;

5)using distinct
SELECT emp_id, emp_name,occupation,sum( distinct working hours) as total_working_hour from employees
group by occupation

In [ ]:
MIN() FUNCTION

In [ ]:
suppose consider a Employees table(emp_id,emp_name,emp_age,city,income)

1)find the minimum income of the employee available in the table:
    select min(income) as min_income from employees;
    
2 finds the minimum income in all rows from the employee table,
specifies all those rows whose emp_age column is greater than or equal to 32 and less than or equal to 40.

select min(income) as min_income from employees
where emp_age>=32 and emp_age<=40;

3) find the minimum income in all rows from the employee table for each emp_age group.
select emp_age, min(income) as min_income from employees
group by emp_age;

4)the below statement returns the minimum income of all employees, 
grouping them based on their city and returns the result whose MIN(income)>150000.

select emp_id, emp_name,city,min(income) as min_income
from employees
group by city
having min(income)>150000;

In [ ]:
MAX()FUNCTION

In [ ]:
suppose consider a Employees table(emp_id,emp_name,emp_age,city,income)

1)find the maximum income of the employee available in the table:
    select max(income)as max_income from employees;

2) finds the maximum income in all rows from the employee table.where emp_age>35;

select max(income) as max_income from employees
where emp_age>35;

3)
find the maximum income in all rows from the employee table for each emp_age group.

select emp_age, max(income) as max_income from employees
group by emp_age;

4)
the following statement returns the maximum income among all employees, grouping them based on their city
and returns the result whose MAX(income) >= 200000.
select emp_name,city,max(income) as max_income from employees
group by city
having max(income)>200000;

5)
select * from employees
where emp_age = (select max(emp_age) from employees);

In [ ]:
mysql first()-return the first value of the selected column.

In [ ]:
conside table officers

oficerID    officer_name     address
1           ajeet            Mau
2          depika           Lucknow
3         vimal          Faizabad
4          rahul          Lucknow


select officer_name 
from officer
limit 1;

It returns ajeet


select officer_name
from officer
limit 2;

It returns ajeet,depika

In [ ]:
Last()

###### cosider same table-- officers

To retrieve last record from a particular column
suppose here we are retreving last record from officer_name column that is 'rahul'
select officer_name
from oficers
order by officerID desc
limit 1;

2)
select officer_name
from officers
order by officer_name desc
limit 1
It returns vimal (2nd last name)